docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-20 Ti 17:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DLM Matlab Toolbox</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Marko Laine" />
<meta name="description" content="Matlab toolbox for some Dynamic Linear Model calculations"
 />
<meta name="keywords" content="DLM, MCMC, time series" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">DLM Matlab Toolbox</h1>
<div id="outline-container-org1dc1c2b" class="outline-2">
<h2 id="org1dc1c2b">Dynamic Linear Model Matlab toolbox</h2>
<div class="outline-text-2" id="text-org1dc1c2b">
<p>
This is a collection of Matlab files for Dynamic Linear Model calculations suitable for time series analysis. The code supplements the article M. Laine, N. Latva-Pukkila and E. Kyrölä: <i>Analyzing time-varying trends in stratospheric ozone time series using state the space approach</i>, in Atmospheric Chemistry and Physics 14(18), 2014, <a href="http://dx.doi.org/10.5194/acp-14-9707-2014">doi: 10.5194/acp-14-9707-2014</a>.
</p>

<p>
The code is provided as auxiliary material for the paper and might be useful to you if you are already familiar with Matlab and MCMC and state space analysis of time series. Some references are given at the end.
</p>

<p>
The toolbox provides tools to estimate dynamic linear state space mode suitable for analysing univariate and multivariate time series. It uses Kalman filter, smoother and simulation smoother to estimate the states and Markov chain Monte Carlo (MCMC) to sample from the model error variance parameter posterior distribution.
</p>

<p>
See <a href="dlmtut.html">DLM tutorial</a> for some info on using this DLM toolbox for time series analysis.
</p>
</div>
</div>

<div id="outline-container-org0a37bd9" class="outline-2">
<h2 id="org0a37bd9">Downloads</h2>
<div class="outline-text-2" id="text-org0a37bd9">
<p>
The full Matlab code and this documentation are available from <a href="https://github.com/mjlaine/dlm">GitHub</a>. To install the toolbox clone the folder <code>dlm</code> to a suitable directory and then add Matlab path to that directory.
</p>

<pre class="example">
git clone https://github.com/mjlaine/dlm.git
</pre>

<p>
Alternatively, you can download the whole repository as a zip file from the GitHub page or directly as
<a href="https://github.com/mjlaine/dlm/archive/master.zip">https://github.com/mjlaine/dlm/archive/master.zip</a>
</p>

<p>
In addition to the code provided below, you will need my <a href="https://mjlaine.github.io/mcmcstat/">Matlab MCMC Toolbox</a> (<a href="https://github.com/mjlaine/mcmcstat">direct Github link</a>). MCMC is used to infer and sample the variance parameters needed in defining the linear state space model.
</p>

<p>
The code is distributed under a MIT License and comes with no warranty. The documentation is minimal at the moment. Please read the source code for details of the algorithms used. Question and suggestions are welcome. If you find the code useful, it would be kind to acknowledge me in your research articles.
</p>
</div>
</div>

<div id="outline-container-org17d425e" class="outline-2">
<h2 id="org17d425e">Examples</h2>
<div class="outline-text-2" id="text-org17d425e">
<p>
Some examples as Matlab demos.
</p>

<dl class="org-dl">
<dt><a href="ex/niledemo.html">Nile river flow</a></dt><dd>Classical Nile river data, file <code>niledemo.m</code>.</dd>
<dt><a href="ex/dlmdemo1.html">DLM demo 1</a></dt><dd>Fits Kalman smoother and does Gibbs sampling on variance parameters.</dd>
<dt><a href="ex/dlmdemo2.html">DLM demo 2</a></dt><dd>Fits synthetic time series with ML optimization.</dd>
<dt><a href="ex/dlmdemo3.html">DLM demo 3</a></dt><dd>Fits synthetic multivariate time series.</dd>
<dt><a href="ex/ozonedemo.html">Ozone time series</a></dt><dd>Reproduces the fit used in the Ozone time series article.</dd>
</dl>


<p>
See also example in the the <a href="dlmtut.html">DLM tutorial</a>.
</p>
</div>
</div>


<div id="outline-container-org6fbf88f" class="outline-2">
<h2 id="org6fbf88f">References</h2>
<div class="outline-text-2" id="text-org6fbf88f">
<p>
Laine, M., Latva-Pukkila, N., Kyrölä, E.,
Analyzing time-varying trends in stratospheric ozone time series using the state space approach, <i>Atmospheric Chemistry and Physics</i>, <b>14(18)</b>, pages 9707&#x2013;9725, 2014.
<a href="http://dx.doi.org/10.5194/acpd-13-20503-2013">doi: 10.5194/acp-14-9707-2014</a>.
</p>

<p>
Durbin, T. and Koopman, S.,/Time Series Analysis by State Space Methods/,
Oxford University Press, second edn, 2012. 
<a href="http://books.google.com/books?vid=ISBN019964117X">Google books link</a>.
</p>

<p>
Petris, G., Petrone, S., and Campagnoli, P.,
<i>Dynamic Linear Models with R, Use R!</i>, Springer, 2009.
<a href="http://books.google.com/books?vid=ISBN0387772383">Google books link</a>.
</p>


<hr>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marko Laine</p>
<p class="date">Created: 2018-11-20 Ti 17:11</p>
<p class="validation"></p>
</div>
</body>
</html>